# Taps
tap "hashicorp/tap"
tap "homebrew/services"
tap "hyperledger/besu"
tap "kurtosis-tech/tap"
tap "max-sixty/worktrunk"
tap "microsoft/mssql-release"
tap "nethermindeth/nethermind"
tap "nikitabobko/tap"
tap "rjcoelho/boneyard"

# Previously managed by nix (home.nix packages)
brew "neovim"
brew "go"
brew "tmux"
brew "solidity"

# Formulae (from `brew leaves`)
brew "awscli"
brew "bash"
brew "bat"
brew "cargo-nextest"
brew "clip"
brew "coreutils"
brew "croc"
brew "dnsmasq"
brew "docutils"
brew "duti"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "gnupg"
brew "gobject-introspection"
brew "graphviz"
brew "grpcurl"
brew "guile"
brew "hashicorp/tap/consul"
brew "helm"
brew "hey"
brew "hyperledger/besu/besu"
brew "ipget"
brew "jd"
brew "jq"
brew "k6"
brew "kurtosis-tech/tap/kurtosis-cli@1.8.1"
brew "lighthouse"
brew "max-sixty/worktrunk/wt"
brew "microsoft/mssql-release/mssql-tools"
brew "mkcert"
brew "mtr"
brew "nethermindeth/nethermind/nethermind"
brew "nnn"
brew "nvm"
brew "pipx"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "ripgrep"
brew "snappy"
brew "sphinx-doc"
brew "starship"
brew "stow"
brew "vegeta"
brew "xclip"
brew "yq"
brew "zoxide"
brew "zplug"

# Tooling for this repo
brew "chezmoi"

# Casks
cask "aerospace"
cask "alacritty"
cask "alt-tab"
cask "ghostty"
cask "kdiff3"
cask "kitty"
cask "openscad"
